// NOT USED BUT COULD BE WHEN TRANSLATION IS IMPLEMENTED
{
    "services":
    [
      {
        "title_en": "You are building a SaaS product and need a CTO for your Minimum Viable Product ?",
        "title_fr": "Vous développez votre produit SaaS et avez besoin d'un CTO pour votre Minimum Viable Product ?",
        "intro_en": "As an entrepreneur starting its own company, choosing the right IT engineer to build your web app is one of the key elements for your success. My experience on different projects allows me to help you choose the most efficient tools and technologies for this purpose. Seeting up a good technical architecture and coding conventions from the start will save you a lot of development time and money in the long run.\n",
        "intro_fr": "En tant qu'entrepreneur, vous avez besoin d'être épaulé pour tout le côté technique de votre projet web. Vous avez besoin d'une personne de confiance et expérimentée qui saura vous suggérer, choisir et mettre en place les bons outils et les bonnes technologies pour atteindre vos objectifs. Une bonne architecture du code et la mise en place de conventions depuis le début du projet vous feront gagner énormément de temps et d'argent sur le long terme.\n"
      },
      {
        "id": "extra",
        "title_en": "Does your development team need additional help to meet the deadline ?",
        "title_fr": "Votre équipe a besoin d'aide pour finir le projet dans les temps ?",
        "intro_en": "There are times when things didn't work as planned and you realise that the project you are working on will take longer than expected. Hiring a developer to support your team on the final steps could help achieve your goals.\n",
        "intro_fr": "Il y a des moments ou tout n'est pas allé comme prévu et vous découvrez que le développement requiert plus de temps que prévu pour finir le projet à temps. C'est rarement facile d'estimer le temps de développement pour les projets web et dans ces cas-là, je pourrais vous aider pour le sprint final. Je suis sûr que cela vous donnera une bonne idée de mes compétences et vous fera travailler de nouveau ensemble ;)\n"
      },
      {
        "id": "outsource",
        "title_en": "Do you want to implement a new complex feature ?",
        "title_fr": "Besoin d'une nouvelle fonctionnalité complexe qui requiert un ingénieur expérimenté ?",
        "intro_en": "Some developments are tricky to implement and require a high level of expertise. You need to make sure that the job will be made properly and using the best practices. Your team may not have the technical skills required so I can take care of such projects like implementing payment or authentication sytems, or building an API for your customers. My experience working on various fields and setting up different technical solutions will ensure you that the job will be done correctly.\n",
        "intro_fr": "Certaines implémentations sont particulièrement délicates à mettre en place et requièrent une personne experimentée pour être sûre de faire les choses dans les règles de l'art, en matière de sécurité ou de workflow. On peut penser à la mise en place d'un système de paiement, le développement d'un système d'authentification, l'implémentation d'une API, etc... Mon expérience m'a permis de traiter de nombreux sujets et de mettre en places de nombreuses solutions techniques qui pourront sûrement vous donner l'assurance que le travail sera bien fait.\n"
      },
      {
        "id": "upgrade",
        "title_en": "Your app has few years, it's time to upgrade it.",
        "title_fr": "Après quelques années, il est temps de faire les mises à jour.",
        "intro_en": "Upgrading your code base is key for the health and the speed of your web site. It ensures that you can count on the latest security patches and features available on the market. I can help you plan an upgrade for your Ruby on Rails or Javascript applications. I will start by checking how well your app is tested via unit tests and/or integration tests. Having a good test suite is essential prior to upgrading the website to make sure that we won't break it.\n",
        "intro_fr": "Garder une application à jour dans les versions des frameworks et librairies utilisés est un point important pour avoir une application web en bonne santé. Les dernières versions sont généralement plus rapides, ont les dernières mises à jour de sécurité et les fonctionnalités les plus modernes sont disponibles. Je peux vous aider à faire une mise à jour de votre application, qu'elle soit une application Ruby on rails ou une application front end Angular ou React. La plupart du temps, je commencerai à évaluer la couverture de tests mise en place, qu'ils soient tests unitaires ou tests d'intégration. Avoir une bonne couverture de tests est très recommandée pour être sûr que la mise à jour ne casse pas les fonctionnalités de votre site.\n"
      },
      {
        "id": "audit",
        "title_en": "Do you need to run technical audits ?",
        "title_fr": "Vous avez besoin de faire une audit sécurité ou qualité ?",
        "intro_en": "Do you need to check the state of your web application ? Has it been correctly developed ? Have all the features been correctly secured? Did it follow the best practices and conventions ? Is there any part of the code that could be improved ? It's always a good idea to rely on an external point of view. I could give you a better insight of the quality of your codebase.\n",
        "intro_fr": "Votre site web a-t-il était développé correctement ou peut-on améliorer certains points ? Suit-il les bonnes pratiques et conventions du métier ? Votre app est elle sécurisée sous tous les angles ? C'est en général une bonne idée d'avoir un point de vue externe, Je peux vous donner une meilleure compréhension de la qualite et la sécurité de votre application.\n"
      },
      {
        "id": "optimisation",
        "title_en": "Is your web application painfully slow to use ?",
        "title_fr": "Vous trouvez que votre application web est trop lente ?",
        "intro_en": "Your users complain about your website being slow and you know that a bad user experience makes them leave and not come back. I can put your project back on track. There are a lot of points that can be improved: front-end optimisation (html, css, images, javascript), back-end optimisation, architecture or database optimisation, etc... I will first assess the app and make a list of the points that need to be optimised. We will then start with the ones that have the biggest impact and that can be fixed in the lesser amount of time.\n",
        "intro_fr": "Vos utilisateurs se plaignent que votre application est lente et vous savez qu'une mauvaise expérience utilisateur fait fuir vos clients. Je peux remettre votre projet dans le bon chemin. Il y a plusieurs d'angles d'attaques possible pour optimiser un site web, que ce soit des optimisations front end (html, css, images, javascript), des optimisations back end sur l'architecture ou sur la base de données, etc.. Je dresserai d'abord une liste des points les plus bloquants de votre site, et l'on travaillera en priorité sur ceux qui auront un plus grand impact et qui pourront être modifiés en un minimum de temps.\n"
      },
      {
        "id": "refactoring",
        "title_en": "Do you have a website with legacy code that needs refactoring ?",
        "title_fr": "Votre code est historique (legacy code) et un refactoring est nécessaire ?",
        "intro_en": "Many companies build up legacy code without having made the corresponding automatic tests, and this generates technical debts. In this scenario, implementing new features or fixing bugs becomes harder, and the maintenance costs grow. When the project can no longer afford to take any more technical debts, modifying and refactoring the code is the only choice. We can work together in putting your project back in the right direction by testing your legacy code and slowly rewriting and cleaning your code.\n",
        "intro_fr": "De nombreuses entreprises accumulent du code historique (legacy code) sans leurs tests automatiques correspondants, cela génère de la dette technique. Dans ce scénario, chaque nouvelle fonctionnalité ou correction est plus difficile et les coûts de maintenance de plus en plus importants. Lorsque le projet ne peut plus se permettre d'endosser ces dettes techniques, la modification et le refactoring du code est le seul choix. Nous pourrions travailler ensemble pour remettre votre projet dans la bonne direction en testant votre code existant et en modifiant petit à petit votre code pour qu'il soit plus compréhensible et plus facilement testable. Cela vous fera gagner en cout de maintenance et fera diminuer le nombre de bugs.\n"
      },
      {
        "id": "hiring",
        "title_en": "Do you need the help of an experienced developer to help you with the hiring process?",
        "title_fr": "Vous recrutez un développeur web et vous voulez faire passer des entretiens par une personne expérimentée ?",
        "intro_en": "Looking for a new developer can be time consuming and finding the right person is not an easy task. Recruitment agencies do some part of the job but you will still need a qualified person for the technical interview. My experience running these type of interviews has allowed me to create a list with the most relevant questions to ask and a collection of exercices to evaluate their technical knowledge. The clients that have put their trust in me in their hiring process have been highly satisfied with my selection.\n",
        "intro_fr": "Embaucher un nouveau développeur peut prendre du temps et trouver la bonne personne n'est pas une tâche facile. Les agences de recrutement font une partie du travail mais vous devez toujours avoir quelqu'un qualifié pour faire l'entretien technique. La préparation de cet entretien est également une tâche fastidieuse. J'ai une liste de questions et d'exercices prêts et mon expérience me donne la confiance nécessaire pour interviewer les développeurs et évaluer leurs connaissances techniques. Les clients pour qui j'ai fait ces interviews ont toujours été satisfaits avec le développeur sélectionné.\n"
      }
    ]
}